## Exercise 02. Preprocessing

1. Считываю CSV-файл, создав ID столбец с индексами.

In [145]:
import pandas as pd

df = pd.read_csv("../data/auto.csv", index_col="ID")
df.head()

       CarNumber  Make_n_model  Refund   Fines  History
ID
0   Y163O8161RUS    Ford Focus     2.0  3200.0      NaN
1    E432XX77RUS  Toyota Camry     1.0  6500.0      NaN
2    7184TT36RUS    Ford Focus     1.0  2100.0      NaN
3   X582HE161RUS    Ford Focus     2.0  2000.0      NaN
4   E34877152RUS    Ford Focus     2.0  6100.0      NaN

2. Подсчитываю количество наблюдений, используя метод count().

In [146]:
df.count()

CarNumber       931
Make_n_model    931
Refund          914
Fines           869
History          82
dtype: int64

3. Удаляю дубликаты, оставив только следующие столбцы: `CarNumber`, `Make_n_Model` и `Fines`

In [147]:
df = df.drop_duplicates(subset=["CarNumber", "Make_n_model", "Fines"], keep="last")
df.count()

CarNumber       725
Make_n_model    725
Refund          713
Fines           665
History          65
dtype: int64

4. Работа с отсутствующими значениями

In [148]:
df.isna().sum()

CarNumber         0
Make_n_model      0
Refund           12
Fines            60
History         660
dtype: int64

In [149]:
df = df.dropna(axis=1, thresh= len(df) - 500) 
df.isna().sum()

CarNumber        0
Make_n_model     0
Refund          12
Fines           60
dtype: int64

Заменяем отсутствующие значения предудущим значением

In [150]:
df["Refund"] = df["Refund"].ffill()
df.isna().sum()

CarNumber        0
Make_n_model     0
Refund           0
Fines           60
dtype: int64

Заменяем `Fines` средними значениями этого столбца

In [151]:
fines_mean = df["Fines"].mean()
df["Fines"] = df["Fines"].fillna(fines_mean)
df.isna().sum()
df.head()

       CarNumber  Make_n_model  Refund   Fines
ID
0   Y163O8161RUS    Ford Focus     2.0  3200.0
1    E432XX77RUS  Toyota Camry     1.0  6500.0
2    7184TT36RUS    Ford Focus     1.0  2100.0
3   X582HE161RUS    Ford Focus     2.0  2000.0
5   92918M178RUS    Ford Focus     1.0  5700.0

5. Разделяю и анализирую марку и модель.

In [152]:
df["Make"] = df["Make_n_model"].apply(lambda x: str(x).split()[0])
df["Model"] = df["Make_n_model"].apply(lambda x: " ".join(str(x).split()[1:]))

In [153]:
df = df.drop(columns=["Make_n_model"])
df.head()

       CarNumber  Refund   Fines    Make  Model
ID
0   Y163O8161RUS     2.0  3200.0    Ford  Focus
1    E432XX77RUS     1.0  6500.0  Toyota  Camry
2    7184TT36RUS     1.0  2100.0    Ford  Focus
3   X582HE161RUS     2.0  2000.0    Ford  Focus
5   92918M178RUS     1.0  5700.0    Ford  Focus

In [154]:
df.to_json("../data/auto.json", orient="records", indent=4)